In [1]:
import numpy as np
import pandas as pd

In [2]:
x = pd.Series([10, 20, 30,40, 50])
x

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
x = pd.Series([10, 20, 30,40, 50], index=list('abcde'))
x

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [4]:
lst = [10, 20, 30,40, 50]
ind = list('abcde')

x = pd.Series(lst, index=ind)
x

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [5]:
a = np.arange(1, 13).reshape(3, 4)
pd.DataFrame(a)

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [6]:
pd.DataFrame(a, columns=['c1', 'c2', 'c3', 'c4'])

   c1  c2  c3  c4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12

In [7]:
pd.DataFrame(a, columns=['c1', 'c2', 'c3', 'c4'], index=['i1', 'i2', 'i3'])

    c1  c2  c3  c4
i1   1   2   3   4
i2   5   6   7   8
i3   9  10  11  12

In [8]:
cols = ['c1', 'c2', 'c3', 'c4']
ind = ['i1', 'i2', 'i3']

pd.DataFrame(a, columns=cols, index=ind)

    c1  c2  c3  c4
i1   1   2   3   4
i2   5   6   7   8
i3   9  10  11  12

In [9]:
# If same keys in the dictinory are missing, pandas will fill them in with NaN value

a = [{'a':10, 'b':20},
     {'b':30, 'c':40}]
pd.DataFrame(a)

      a   b     c
0  10.0  20   NaN
1   NaN  30  40.0

In [10]:
for i in range(5):
    print({'c1':i, 'c2':i*2})

{'c1': 0, 'c2': 0}
{'c1': 1, 'c2': 2}
{'c1': 2, 'c2': 4}
{'c1': 3, 'c2': 6}
{'c1': 4, 'c2': 8}

In [11]:
a = np.arange(1, 13).reshape(3, 4)
df = pd.DataFrame(a)
df

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [12]:
r, c = df.shape
print("Row: ", r)
print("Columns: ", c)

Row:  3
Columns:  4

In [13]:
df.dtypes

0    int32
1    int32
2    int32
3    int32
dtype: object

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
x = pd.DataFrame(np.arange(1, 13).reshape(3, 4), columns=['c1', 'c2', 'c3', 'c4'], index=['i1', 'i2', 'i3'])
x

    c1  c2  c3  c4
i1   1   2   3   4
i2   5   6   7   8
i3   9  10  11  12

In [16]:
x.isnull()

       c1     c2     c3     c4
i1  False  False  False  False
i2  False  False  False  False
i3  False  False  False  False

In [17]:
x.isnull().sum()

c1    0
c2    0
c3    0
c4    0
dtype: int64

In [18]:
data = {
    'C1':[10, 20, 30, np.NaN],
    'C2':[np.NaN, 2, 4, 1],
    'C3':[100, 200, 300, 0],
    'C4':[np.NaN, 11, 12, 13]
}
df = pd.DataFrame(data)
df

     C1   C2   C3    C4
0  10.0  NaN  100   NaN
1  20.0  2.0  200  11.0
2  30.0  4.0  300  12.0
3   NaN  1.0    0  13.0

In [19]:
df.isnull()

      C1     C2     C3     C4
0  False   True  False   True
1  False  False  False  False
2  False  False  False  False
3   True  False  False  False

In [20]:
df.isnull().sum()

C1    1
C2    1
C3    0
C4    1
dtype: int64

In [21]:
df.dtypes

C1    float64
C2    float64
C3      int64
C4    float64
dtype: object

In [22]:
# Multi-index, Multi-columns

a = np.arange(1, 17).reshape(4, 4)
df = pd.DataFrame(a, index=[list('RRRR'), ['R1', 'R1', 'R2', 'R2'], ['r1', 'r2', 'r3', 'r4']],
                     columns=[['C1', 'C1', 'C2', 'C2'], ['c1', 'c2', 'c3', 'c4']])

df

         C1      C2
         c1  c2  c3  c4
R R1 r1   1   2   3   4
     r2   5   6   7   8
  R2 r3   9  10  11  12
     r4  13  14  15  16